tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "sass/sass"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Manage compile and link flags for libraries
brew "pkg-config"
# Distributed revision control system
brew "git"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Scalable distributed version control system
brew "mercurial"
# Cross platform, open source .NET development framework
brew "mono", link: false
# Platform built on V8 to build network applications
brew "node", link: false
# Object-relational database system
brew "postgresql"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Ruby version manager
brew "rbenv"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# SDL2 graphics drawing primitives and other support functions
brew "sdl2_gfx"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Image file loading library
brew "sdl_image"
# Library for using TrueType fonts in SDL applications
brew "sdl_ttf"
# JavaScript package manager
brew "yarn"
# SDK
brew "dart-lang/dart/dart"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Open-source version of the X.Org X Window System
cask "xquartz"
